app/views/steps/_step.html.erb

  <p>Comments</p>
    <% if step.comments.any? %>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."step_id" = ? LIMIT ?  [["step_id", 1], ["LIMIT", 1]]