app/views/posts/_form.html.erb

SELECT "tags".* FROM "tags" ORDER BY "tags"."name" ASC
---
    <%= f.label :tag_list, "Tags" %>
    <%= f.collection_select :tag_ids, Tag.order(:name), :id, :name, {}, {multiple: true} %>

SELECT  1 AS one FROM "steps" WHERE "steps"."post_id" = ? LIMIT ?  [["post_id", 2], ["LIMIT", 1]]
---
  <div id = "steps">
  <% if post.steps.any? %>