app/views/posts/edit.html.erb

SELECT  1 AS one FROM "steps" WHERE "steps"."post_id" = ? LIMIT ?  [["post_id", 3], ["LIMIT", 1]]
---
<div id = "steps">
  <% if @post.steps.any? %>