app/views/posts/index.html.erb

      <tr>
        <td><%= link_to post.title, post%> Tags : <%= raw post.tag_list.map {|t| link_to t, tag_path(t) }.join(', ') %></td>
---
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('tag_tag'))