app/views/posts/show.html.erb

SELECT  "steps".* FROM "steps" WHERE "steps"."post_id" = ? ORDER BY priority ASC LIMIT ? OFFSET ?  [["post_id", 5], ["LIMIT", 1], ["OFFSET", 3]]
SELECT  1 AS one FROM "steps" WHERE "steps"."post_id" = ? LIMIT ?  [["post_id", 1], ["LIMIT", 1]]
---
<p>
  <% if @post.steps.any? %>