app/controllers/posts_controller.rb

  def index
  if params[:tag]
    @products = Post.tagged_with(params[:tag])
  else
    @products = Post.all
---
SELECT "posts".* FROM "posts"
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN posts ON posts.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Post' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT posts.id FROM "posts")) GROUP BY taggings.tag_id HAVING (COUNT(taggings.tag_id) > 0)) AS taggings ON taggings.tag_id = tags.id

  def show
    @steps = @post.steps.paginate(page: params[:page], per_page: 1)
---
SELECT  "steps".* FROM "steps" WHERE "steps"."post_id" = ? ORDER BY priority ASC LIMIT ? OFFSET ?  [["post_id", 4], ["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "steps" WHERE "steps"."post_id" = ?  [["post_id", 4]]

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sadkfbasdfk"], ["content", "dsafasdbkf"], ["user_id", 1], ["created_at", 2017-03-02 13:08:08 UTC], ["updated_at", 2017-03-02 13:08:08 UTC]]