app/controllers/steps_controller.rb

UPDATE "steps" SET "priority" = 1 WHERE "steps"."id" IN (SELECT "steps"."id" FROM "steps" WHERE "steps"."id" = ? ORDER BY priority ASC)  [["id", 10]]
---
  def sort
    params[:order].each do |key,value|
      Step.find(value[:id]).update_attribute(:priority,value[:position])

INSERT INTO "steps" ("post_id", "user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["post_id", 10], ["user_id", 2], ["title", "sasaass"], ["content", "saddd"], ["created_at", 2017-03-04 23:27:18 UTC], ["updated_at", 2017-03-04 23:27:18 UTC]]
---
  def create
  	@step = @post.steps.build(steps_params)
  	@step.user = current_user
  	@step.save

UPDATE "steps" SET "title" = ?, "content" = ?, "stepimage" = ?, "updated_at" = ? WHERE "steps"."id" = ?  [["title", "quar"], ["content", "ereus"], ["stepimage", "xc03lvkb5eaweqfro1v4.jpg"], ["updated_at", 2017-03-10 12:04:21 UTC], ["id", 4]]
---
  def update
  	@step.update(steps_params)

DELETE FROM "steps" WHERE "steps"."id" = ?  [["id", 19]]
---
  def destroy
  	@step.destroy

SELECT  "steps".* FROM "steps" WHERE "steps"."post_id" = ? AND "steps"."id" = ? ORDER BY priority ASC LIMIT ?  [["post_id", 11], ["id", 31], ["LIMIT", 1]]
---
  def find_step
  	@step = @post.steps.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def find_post
  	@post = Post.find(params[:post_id])